
// ask_1
// Улитка ползёт по вертикальному шесту высотой h метров,
//  поднимаясь за день на a метров, а за ночь спускаясь на b 
//  метров. На какой день улитка доползёт до вершины шеста?
//  Программа получает на вход натуральные числа h, a, b.
//   Гарантируется, что a>b.Программа должна вывести одно 
//   натуральное число. Sample Input 1: 10 3 2 Sample 
//   Output 1: 8 class MyProgram{ public static void main(String[] 
//   args){ } } Task_2 Требуется определить, можно ли от шоколадки
//    размером n × m долек отломить k долек, если разрешается сделать 
//    один разлом по прямой между дольками (то есть разломить шоколадку
//     на два прямоугольник

package Semenar1;

public class Task1 {
    
}


